brew "docker"
brew "docker-credential-helper"
brew "docker-compose"
brew "colima"
brew "asdf"
brew "wireguard-tools"
brew "mas"
brew "rcm"
brew "vim"
brew "ripgrep"
brew "thefuck"
brew "graphviz"
brew "htop"
brew "iftop"
brew "ollama"

cask "libreoffice"
cask "autodesk-fusion"
cask "iterm2"
cask "openvpn-connect"
cask "dropbox"
cask "keepassxc"
cask "firefox"
cask "thunderbird"
cask "lightburn"
cask "inkscape"
cask "gimp"
cask "tailscale"
cask "lm-studio"
cask "discord"
cask "stability-matrix"

mas "Final Cut Pro", id: 424389933
mas "Compressor", id: 424390742
mas "Infuse", id: 1136220934
mas "Slack for Desktop", id: 803453959
mas "Wireguard", id: 1451685025
